tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "messense/macos-cross-toolchains"
tap "pulumi/tap"
tap "sst/tap"
tap "weaveworks/tap"
brew "automake"
brew "openssl@3"
brew "readline"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "bazelisk"
brew "gettext"
brew "python@3.13"
brew "ccache"
brew "gcc"
brew "libomp"
brew "pkgconf"
brew "cloudflared"
brew "cmake"
brew "ruby"
brew "cocoapods", link: false
brew "coreutils"
brew "docker-compose"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "k6"
brew "kubernetes-cli", link: false
brew "libiconv"
brew "libtool"
brew "llvm"
brew "llvm@18"
brew "make"
brew "minicom"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nvm"
brew "opencv"
brew "p7zip"
brew "pipx"
brew "postgresql@12"
brew "postgresql@14"
brew "postgresql@17"
brew "pyenv"
brew "python@3.11"
brew "python@3.9"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "wget"
brew "zig"
brew "jesseduffield/lazygit/lazygit"
brew "pulumi/tap/pulumi"
brew "sst/tap/sst"
brew "weaveworks/tap/eksctl"
cask "claude"
cask "clipy"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "iterm2"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
vscode "4a454646.github-purple"
vscode "adpyke.vscode-sql-formatter"
vscode "amodio.tsl-problem-matcher"
vscode "better-ts-errors.better-ts-errors"
vscode "bierner.comment-tagged-templates"
vscode "bierner.emojisense"
vscode "bierner.github-markdown-preview"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bwork.zig-tools"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "ianic.zig-language-extras"
vscode "jnoortheen.nix-ide"
vscode "jscearcy.rust-doc-viewer"
vscode "kevinrose.vsc-python-indent"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "mylesmurphy.prettify-ts"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sbsnippets.pytorch-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wallabyjs.quokka-vscode"
vscode "webfreak.debug"
vscode "xaver.clang-format"
vscode "ybaumes.highlight-trailing-white-spaces"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
